In [1]:
import pandas as pd 
df_CPI = pd.read_csv('D:/project_data_mining/dataset_CPI.csv')
# obs_value: observation value 
# dữ liệu lấy từ 01-2011-> 12-2025


# # Chuyển TIME_PERIOD sang định dạng YYYY-MM (nếu đang ở dạng "1971M01")
df_CPI['TIME_PERIOD'] = df_CPI['TIME_PERIOD'].str.replace('M', '', regex=False)  
df_CPI = df_CPI[['COUNTRY','COICOP_1999', 'TIME_PERIOD', 'OBS_VALUE']].copy()
df_CPI = df_CPI.rename(columns={'COICOP_1999': 'Expenditure_category', 'OBS_VALUE': 'CPI'})
df_CPI.head(5)

   COUNTRY              Expenditure_category TIME_PERIOD  CPI
0  Myanmar  Miscellaneous goods and services     2011-01  NaN
1  Myanmar  Miscellaneous goods and services     2011-02  NaN
2  Myanmar  Miscellaneous goods and services     2011-03  NaN
3  Myanmar  Miscellaneous goods and services     2011-04  NaN
4  Myanmar  Miscellaneous goods and services     2011-05  NaN

In [2]:
import pandas as pd

df2 = pd.read_excel('D:/project_data_mining/CMO-Historical-Data-Monthly.xlsx',sheet_name="Monthly Indices", header=5 , engine='openpyxl')
# df2.head(5)

df2 = df2.rename(columns={df2.columns[0]: "TIME_PERIOD"})

# change name column 
df_energy = df2[["TIME_PERIOD", "Energy"]].copy()

df_energy["TIME_PERIOD"] = (
    df_energy["TIME_PERIOD"]
    .astype(str)
    .str.replace("M", "-", regex=False)
)
# convert TIME_PERIOD to YYYY-MM format 
df_energy["TIME_PERIOD"] = pd.to_datetime(df_energy["TIME_PERIOD"],format="%Y-%m")
df_energy["TIME_PERIOD"] = df_energy["TIME_PERIOD"].dt.strftime("%Y-%m")

# filter 2000–2024
df_energy = df_energy[(df_energy["TIME_PERIOD"] >= "2000-01") & (df_energy["TIME_PERIOD"] <= "2025-03")]

# save CSV file
# df_energy.to_csv("energy_monthly_2000_2024.csv", index=False)

df_energy.tail()

    TIME_PERIOD      Energy
778     2024-08  102.646161
779     2024-09   95.373156
780     2024-10   97.670693
781     2024-11   96.513796
782     2024-12   96.498655

In [3]:
# merge energy and CPI dataset  
df = pd.merge(
    df_CPI,
    df_energy,
    on="TIME_PERIOD",
    how="left"   )
df.tail(100)

         COUNTRY    Expenditure_category TIME_PERIOD  CPI     Energy
24418  Indonesia  Restaurants and hotels     2017-08  NaN  66.409457
24419  Indonesia  Restaurants and hotels     2017-09  NaN  70.740939
24420  Indonesia  Restaurants and hotels     2017-10  NaN  73.276458
24421  Indonesia  Restaurants and hotels     2017-11  NaN  78.953263
24422  Indonesia  Restaurants and hotels     2017-12  NaN  80.828238
...          ...                     ...         ...  ...        ...
24513  Indonesia  Restaurants and hotels     2025-07  NaN        NaN
24514  Indonesia  Restaurants and hotels     2025-08  NaN        NaN
24515  Indonesia  Restaurants and hotels     2025-09  NaN        NaN
24516  Indonesia  Restaurants and hotels     2025-10  NaN        NaN
24517  Indonesia  Restaurants and hotels     2025-11  NaN        NaN

[100 rows x 5 columns]

In [4]:
import pandas as pd

df_GDP = pd.read_csv('D:/project_data_mining/GDP_dataset.csv')

# change name column time_period to year
df_GDP = df_GDP.rename(columns={'TIME_PERIOD': 'YEAR', 'OBS_VALUE': 'GDP'})
# df_GDP.columns
df_GDP['YEAR'] = df_GDP['YEAR'].astype(int)

# get year from time_period month 
df['YEAR'] = df['TIME_PERIOD'].str.slice(0, 4)
df['YEAR'] = pd.to_numeric(df['YEAR'], errors='coerce') 
df['YEAR'] = df['YEAR'].astype('Int64')

# merge data with GDP dataset 
df = df.merge(df_GDP[['COUNTRY', 'YEAR', 'GDP']], on =['COUNTRY', 'YEAR'], how='left')
df.head(5)

,COUNTRY,Expenditure_category,TIME_PERIOD,CPI,Energy,YEAR,GDP
0,Myanmar,Miscellaneous goods and services,2011-01,NaN,120.130826,2011,54784.1
1,Myanmar,Miscellaneous goods and services,2011-02,NaN,127.439088,2011,54784.1
2,Myanmar,Miscellaneous goods and services,2011-03,NaN,138.374412,2011,54784.1
3,Myanmar,Miscellaneous goods and services,2011-04,NaN,148.264355,2011,54784.1
4,Myanmar,Miscellaneous goods and services,2011-05,NaN,139.061356,2011,54784.1

In [5]:
# CPI singapore
df = df[df["COUNTRY"]=="Singapore"]
df.head()

,COUNTRY,Expenditure_category,TIME_PERIOD,CPI,Energy,YEAR,GDP
14891,Singapore,Clothing and footwear,2011-01,100.231,120.130826,2011,361.418
14892,Singapore,Clothing and footwear,2011-02,100.495,127.439088,2011,361.418
14893,Singapore,Clothing and footwear,2011-03,103.109,138.374412,2011,361.418
14894,Singapore,Clothing and footwear,2011-04,102.626,148.264355,2011,361.418
14895,Singapore,Clothing and footwear,2011-05,101.937,139.061356,2011,361.418

In [6]:

df['Expenditure_category'].unique()

array(['Clothing and footwear', 'Food and non-alcoholic beverages',
       'Alcoholic beverages, tobacco and narcotics', 'Communication',
       'Education', 'Housing, water, electricity, gas and other fuels',
       'Transport', 'Miscellaneous goods and services',
       'Furnishings, household equipment and routine household maintenance',
       'All Items', 'Restaurants and hotels', 'Health',
       'Recreation and culture'], dtype=object)

In [7]:
df = df.drop(columns = ["COUNTRY"])

In [8]:
df.shape

(2314, 6)

In [9]:
# save CSV file
df.to_csv("dataset.csv", index=False)